In [54]:
import pandas as pd
import numpy as np

In [55]:
df = pd.DataFrame(
    {"a": [1,2,np.nan,5],
     "b": [3,np.nan,4,3],
     "c": [5,np.nan,np.nan,6],
     "d": [np.nan,7,8,1],
     "e": [np.nan,np.nan,9,10],
     "f": [11,12,13,14]}
    )
df

     a    b    c    d     e   f
0  1.0  3.0  5.0  NaN   NaN  11
1  2.0  NaN  NaN  7.0   NaN  12
2  NaN  4.0  NaN  8.0   9.0  13
3  5.0  3.0  6.0  1.0  10.0  14

In [56]:
df.dropna(axis=0)

     a    b    c    d     e   f
3  5.0  3.0  6.0  1.0  10.0  14

In [57]:
df.dropna(axis=1)

    f
0  11
1  12
2  13
3  14

In [58]:
df.fillna(0)

     a    b    c    d     e   f
0  1.0  3.0  5.0  0.0   0.0  11
1  2.0  0.0  0.0  7.0   0.0  12
2  0.0  4.0  0.0  8.0   9.0  13
3  5.0  3.0  6.0  1.0  10.0  14

In [59]:
df_r = df.copy()
df_r.dropna(axis=0, inplace=True)
df_r

     a    b    c    d     e   f
3  5.0  3.0  6.0  1.0  10.0  14

In [61]:
df_c = df.copy()
df_c.dropna(axis=1, inplace=True)
df_c

    f
0  11
1  12
2  13
3  14